#Чекалін Нікіта Валерійович     1 курс  Колоквіум   Завдання 1

#Введіть з клавіатури в масив 5 цілочисельних значень. Виведіть їх в 1 стрічку через кому. Отримайте середнє значення

import numpy as np
while True:
    try:
        b = ""
        c = 0
        a = np.array([int(input("Введіть число: ")) for i in range(5)])#створення масиву і запис в нього значень
        for i in range(len(a)):
            c += a[i]
            b += str(a[i])+','#додаємо кому між числами
        print("Середнє значення: ", c/5)#обрахунок
        print('Стрічка: ', b[:-1])
    except ValueError:
        print("Не коректне значення")
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
