#Чекалін Нікіта Валерійович 1 курс Завдання 11

#Дані про температуру води на Чорноморському узбережжі за декаду
#вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
#купання.


import numpy as np

while True:
    a = np.zeros(10, dtype=int)
    count = 0
    for i in range(len(a)):
        a[i] = int(input("Введіть температуру води  "))#заповнення значеннями
        if a[i] > 50 or a[i] < 0:#задданя умови на перевірку коректності задання значень
            print("Не коректна температура")
            i -=1
            continue
    for i in range(len(a)):#зададаня умови на визначення днів що придатні
        if a[i] <= 21:
            count += 1#
    print("Масив: ",a)
    print("Дні придатні для купання", count)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
