#Чекалін Нікіта Валерійович 1 курс Завдання 12


#Дані про температуру повітря за декаду грудня зберігаються в масиві.
#Визначити, скільки раз температура була вище середньої за цю декаду.


import numpy as np

while True:
    a = np.zeros(10, dtype=int)
    count = 0
    for i in range(len(a)):
        a[i] = int(input("Введіть температуру  "))#заповнення занченнямми
    b = np.average(a)
    for i in range(len(a)):
        if a[i] > b:#умова яка перевірятиме температуру
            count += 1
    print("Масив: ",a)
    print("Кількість днів з температурою вище середньої",count)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
