#Чекалін Нікіта Валерійович 1 курс Завдання 13

#Створіть масив з 15 цілочисельних елементів і визначте серед них
#мінімальне значення.

import numpy as np

while True:
    try:
        a = np.array([int(input("Введіть число: ")) for i in range(15)])#створення і заповнення даними масиву
        i = 0
        m = a[i]
        while i < len(a):#блок на знаходження мін числа
            if a[i] < m:
                nm = i
                m = a[nm]
            i += 1

        print("Масив: ",a)
        print("Мінімальне значення",m)
    except ValueError:
        print("Не коректне значення")

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
