#Чекалін Нікіта Валерійович 1 курс Завдання 14

#Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
#пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.

import numpy as np
while True:
    a = np.zeros(10, dtype=float)
    for i in range(len(a)):#створення циклу 
        a[i] = (9.81 * (i+1)**2)/2#формула обрахунку вільного падіння 
    print("Масив: ",a)

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
