#Чекалін Нікіта Валерійович 1 курс Завдання 15

#Знайти суму парних елементів масиву цілих чисел. Розмірність масиву -
#20. Заповнення масиву здійснити випадковими числами від 100 до 200.

import numpy as np
import random
while True:
    a = np.array([random.randint(100,200) for i in range(20)])#створення і заповнення масиву елементами
    s = 0
    for i in range(len(a)):#визначення парного числа
        if a[i] % 2 == 0:
            s += a[i]
        i += 1#лічильник
    print("Сумма парних чисел ",s)
    print("Масив: ",a)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
