#Чекалін Нікіта Валерійович 1 курс Завдання 17

#Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
#Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100
#до 200.

import numpy as np
import random
while True:
    a = np.array([random.uniform(100,200) for i in range(20)])#створення і заповнення елементами масиву
    s = 0
    for i in range(len(a)):
        if i % 2 != 0:#заданння умови для знах непарного номеру
            s += a[i]
    print("Сумма: ",s)
    print("Масив: ",a)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
