#Чекалін Нікіта Валерійович 1 курс Завдання 19


#Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
#остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
#здійснити випадковими числами від 200 до 300.

import numpy as np
import random
while True:
    try:
        a = np.array([random.randint(200,300) for i in range(20)])#створення масиву і запис в нього значень за доп рандому
        s = 0
        for i in range(len(a)):
            if a[i] % 2 == 3:#умова на знах остачі
                s += a[i]
        print("Масив: ",a)
        print("Добуток: ",s)
    except ValueError:
        print("Не коректне значення")

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
