#Чекалін Нікіта Валерійович 1 курс Завдання 20

#Знайти суму всіх елементів масиву дійсних чисел, більших за задане
#число. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами
#від 50 до 100.

import numpy as np
import random
while True:
    try:
        a = np.array([random.uniform(50,100) for i in range(20)])#створення масиву і запис в нього значень
        n = int(input("Введіть число: "))
        s = 0
        for i in range(len(a)):#задання умови для визначення чи більше число чи ні
            if a[i] > n:
                s += a[i]
        print("Масив: ",a)
        print("Сумма: ",s)
    except ValueError:
        print("Не коректне значення")

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
