
#Чекалін Нікіта Валерійович 1 курс Завдання 21

#Знайти добуток всіх елементів масиву дійсних чисел, менших заданого
#числа. Розмірність масиву  10. Заповнення масиву здійснити випадковими числами
#від 50 до 100.

import numpy as np
import random
while True:
    try:
        a = np.array([random.uniform(50,100) for i in range(10)])#створення масиву і запис в нього значень
        n = int(input("Введіть число: "))
        s = 1
        for i in range(len(a)):
            if a[i] < n:#створення умови на знах мен числа чи ні
                s = s * a[i]
        print("Масив: ",a)
        print("Добуток: ",s)
    except ValueError:
        print("Не коректне значення")

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
