#Чекалін Нікіта Валерійович 1 курс Завдання 24

#Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
#одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
#числами від 500 до 1000.


import numpy as np
import random
while True:
    try:
        a = np.array([random.randint(10,100) for i in range(30)])#створення масиву і запис в нього значень
        s = 0
        for i in range(len(a)):
            if a[i] % 5 == 0 and a[i] % 8 == 0:#pзадання умови на кратність5 і 8
                s += a[i]
        print("Масив: ",a)
        print("Сумма: ",s)
    except ValueError:
        print("Не коректне значення")

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
