#Чекалін Нікіта Валерійович 1 курс Завдання 25

#Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
#Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 10 до
#100.

import numpy as np
import random
while True:
    try:
        a = np.array([random.randint(10,100) for i in range(10)])#створення масиву і запис в нього значень
        d = 1
        for i in range(len(a)):#створення циклу для перевірки на кратність 5
            if a[i] % 5 == 0:
                d =d * a[i]
        print("Масив: ",a)
        print("Добуток: ",d)
    except ValueError:
        print("Не коректне значення")

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
