#Чекалін Нікіта Валерійович 1 курс Завдання 26

#Напишіть програму аналізу значень температури хворого за добу:
#визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
#температури виробляються шість раз на добу і результати вводяться з клавіатури у
#масив T.

import numpy as np

while True:
    try:
        t = np.zeros(6,dtype=int)
        for i in range(len(t)):
            t[i] = int(input("Введіть температуру: "))#створення масиву і запис в нього значень
            if t[i]>36 and t[i]<42:#перевірка на вед кореткого знач
                continue
            else:
                t[i] = 0
                break
        i = 0
        m = t[i]
        mx = t[i]
        s =0
        while i < len(t):
            if t[i] < m:
                nm = i
                m = t[nm]
            if t[i] > mx:#визнач макс тепмпр
                nm = i
                mx = t[nm]
            s += t[i]
            i += 1
        print("Масив: ",t)
        print("Мінімальна температура: ",m,"Максимальна температура: ",mx,"Середня температура: ",s/6)
    except ValueError:
        print("Не коректне значення")

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
