#Чекалін Нікіта Валерійович 1 курс Завдання 30

#Знайти кількість парних елементів одновимірного масиву до першого
#зустрінутого числа рівного наперед заданому числу а.

import numpy as np
import random
while True:
    b = np.array([random.randint(10,100) for i in range(20)])#створення масиву і запис в нього значень
    print("Масив: ", b)
    a = int(input('Введіть до якого числа рахувати парні числа: '))
    count = 0
    for i in range(len(b)):#умова на знах к-ль парних чисел
        if b[i] == a:
            break
        if b[i] % 2 == 0:
            count+=1
    print("Кількість парних чисел: ",count)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
