#Чекалін Нікіта Валерійович 1 курс Завдання 31

"""
Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які потрапляють в інтервал від -2 до 10.
"""

import numpy as np
import random
while True:
    a = np.array([random.randint(-10,20) for i in range(20)])#створення масиву за доп рандома
    print("Масив: ", a)#
    s = 0
    count = 0
    for i in range(len(a)):#задання умови для інтервалу
        if -2 <= a[i] >= 10:
            count += 1
            s += a[i]
    print("Середнє арифметичне серед тих що входять в інтервал від -2 до 10: ",s/count)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
