#Чекалін Нікіта Валерійович 1 курс Завдання 33
"""
Заданий масив А (1:20). Знайти добуток всіх його ненульових елементів.
"""
import numpy as np

while True:
    try:
        a = np.zeros(10, dtype=int)
        d = 1
        for i in range(len(a)):
            a[i] = int(input("Введіть число: "))#заповнення елементами масиву
            if a[i] != 0:
                d = d*a[i]#умова при якій буде знах добуток не нульвих ел
        print("Масив: ",a)
        print("Добуток не нульових елементів: ",d)
    except ValueError:
        print("Не коректне значення")

    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
