#Чекалін Нікіта Валерійович 1 курс Завдання 34

"""
Дано два лінійних масиву однакової розмірності. Скласти третій масив з
добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
"""

import numpy as np
while True:
    n = int(input("Введіть розмірність масивів "))

    a = np.random.randint(0, 50, size=n)#рандомізація чисел у заданому діапазоні
    b = np.random.randint(0, 50, size=n)#рандомізація чисел у заданому діапазоні
    c = np.zeros(n)
    print(a)
    print(b)
    for i in range(n):
        c[i] =a[i] * b[i]#процес множення масивів
    print(c)
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
