#Чекалін Нікіта Валерійович 1 курс Завдання 4

#Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які
#починаються з певної букви, яка вводиться з клавіатури.


import numpy as np
while True:
    a = np.zeros(5, dtype=object)
    b = []                  #створення масиву 
    x = input("Введіть букву на яку починається фамілія: ")
    for i in range(5):#запис в нього значень
        a[i] = input("Введіть фамілію: ")
        if x[0] == a[i][0]:#умова
            b.append(a[i])#приєднання
            continue
    print("Фамілія на задану букву: ", b)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
