#Чекалін Нікіта Валерійович 1 курс Завдання 40

"""
Обчислити суму парних елементів одновимірного масиву до першого
зустрінутого нульового елемента.
"""
import numpy as np
while True:
    try:
        a = np.random.randint(-10,10, size=10)#створення посл за доп рандм
        count = 0
        for i in range(len(a)):#перебір елементів і задання умови на суму
            if a[i] % 2 == 0:
                count += a[i]
            if a[i] ==0:
                break

        print("Масив: ",a)

        print("Сумма парних елементів масиву до першого зустрічного 0:  ",count)
    except ValueError:
        print("Не коректне значення" )

    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
