#Чекалін Нікіта Валерійович 1 курс Завдання 44


"""Підрахуйте кількість елементів одновимірного масиву, які збігаються зі
своїм номером і при цьому кратні 3."""


import numpy as np
while True:
    try:
        mas = np.random.randint(-10, 10, size=10)#створенн япослідовності за рах рандомізац значень

        count = 0
        for i in range(len(mas)):
            if mas[i] == i and mas[i] % 3 ==0:#задання умови чка перевіряє збігання і парність
                count += 1
        print("Масив: ", mas)
        print("Кількість елементів які співпадають зі своїм номером і при цьому крані 3", count)
    except ValueError:
        print("Не коректне значення")
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
