#Чекалін Нікіта Валерійович 1 курс Завдання 46
"""Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
"""
import numpy as np
while True:
    try:
        n = int(input("Введіть кількість товару: "))#запис к-ль у масив
        a = np.zeros(n, dtype=object)
        count = 0
        for i in range(len(a)):
            a[i] = input("Введіт назву товару: ")#запис назв за доп циклу
            if a[0] == a[i]:
                count += 1  #лічильник
        print("Масив: ", a)
        if count > 1:
            b = a[1:len(a)]#умова на перевырку елемента
            print("Масив без 1 елементу", b)
        else:
            print("Перший елемент унікальний")

    except ValueError:
        print("Не коректне значення")
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
