#Чекалін Нікіта Валерійович 1 курс Завдання 47

"""У лінійному масиві знайти максимальний елемент. Вставте порядковий
номер елемента за ним, пересунувши всі залишилися на одну позицію вправо.
"""


import numpy as np
while True:
    try:
        n = int(input("Введіть кількість елементів: "))#запис к-ль елементів
        a = np.zeros(n, dtype=int)

        for i in range(len(a)):
            a[i] = int(input("Введіть число: "))#введення чисел через цикл
        print(a)
        i = 0
        m = a[i]
        mi = 0
        while i < n:#перевірка на к-ль елементів
            if a[i] > m:
                nm = i
                m = a[nm]
                mi = i
            i += 1
        b = a.copy()#використанн яметоду копі для копіювання ел в новий масив
        b.resize(n+1)
        for i in range(n):
            if b[i] == m:  #перебір і умова для елементів
                b[i+1] = mi
        t = np.concatenate((b[:mi+2], a[mi+1::]), axis=0) #приєднуємо небхідні елементи
        print(b)
        print(t)



    except ValueError:
        print("Не коректне значення")
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
