#Чекалін Нікіта Валерійович 1 курс Завдання 48


"""
Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте
місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього
з початку і третього від кінця і т.д.
"""

import numpy as np
while True:
    try:
        n = int(input("Введіть кількість брокерів: "))#запис брокерів у масив
        a = np.zeros(n,dtype=object)
        for i in range(n):
            a[i] = input("Введіть фамілію: ")#запис фамілій через цикл  у масив
        print(a)

        print(a[::-1])#виведення навпаки завдяки зрізу
    except ValueError:
        print("Не коректне значення")
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
