#Чекалін Нікіта Валерійович 1 курс Завдання 5

#Створіть масив А [1..7] за допомогою генератора випадкових чисел і
#виведіть його на екран. Збільште всі його елементи в 2 рази.


import numpy as np
import random
while True:
    a = np.array([random.randint(1,100) for i in range(7)])#створення масиву за доп рандома і запис в нього значень
    b = np.array([a[i]*2 for i in range(7)])#збільшення у 2 рази
    print("Масив:  ", a)
    print("Масив в якуму всі елементи в 2 рази більші ",b)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
