#Чекалін Нікіта Валерійович 1 курс Завдання 51
"""
Дан одновимірний масив а. Сформувати новий масив, який складається
тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
елементів немає, то видати повідомлення.
"""

import numpy as np
from random import sample
while True:
    try:

        a = np.array(sample(range(1, 50), 10))#використаєм який повертає певний список довжин елементів, вибраних із послідовності
        c = []
        for i in range(len(a)):
            if a[i] > i * 10:#задання умови на перевырку значень
                c.append(a[i])
        print(a)
        print(c)

    except ValueError:
        print("Не коректне значення")
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
