#Чекалін Нікіта Валерійович 1 курс Завдання 52
"""
Знайти найбільший елемент з елементів одновимірного масиву, що мають
парний номер. Визначити, чи є він єдиним.
"""
import numpy as np
while True:
    try:
        n = int(input("Введіть кількість елементів: "))#введення к-льсті   елементів
        a = np.random.randint(0,50,size=n)#заповнення масиву рандомним значеннми
        b = a[::2]
        i = 0
        m = b[i]
        while i < len(b):#перевірка на найб елемент
            if b[i] > m:
                nm = i
                m = b[nm]
            i += 1
        for i in range(len(a)): #задання умови на первірку найб парного елемента
            if m == a[i]:
                i += 1



        print("Масив: ", a)
        print("Масив з парних номерів: ",b)
        print("Максимальний серед парнх номерів",m)
    except ValueError:
        print("Не коректне значення")
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
