#Чекалін Нікіта Валерійович 1 курс Завдання 55
"""
У будинку, що складається з 30 квартир, переселити мешканців так, щоб
мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
"""
import numpy as np
while True:
    try:
        n = 0
        x = np.zeros(30, dtype=int)         #створення мас з  нулями
        for i in range(len(x)):
            x[i] = int(input("Введіть кількість жителів: "))
        print(x)
        x = x[::-1]  #робим навпаки за доп зрізу
        for i in range(len(x)):
            if x[i] >= 5:#задання умови
                n +=1
        print(x)
        print("Kількість квартир в якій проживають більше ніж 5 жителів: ",n)


    except ValueError:
        print("Не коректне значення")
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
