#Чекалін Нікіта Валерійович 1 курс Завдання 57

"""Відомість на зарплату представлена як дві таблиці. Одна містить
прізвища працівників цеху, а друга - їх зарплату за поточний місяць. Знайдіть прізвище
працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою
заробітною платою. Видаліть з відомості на зарплату відомості про працівника,
зарплата якого мінімальна."""


import numpy as np
def bubblesort(list):
    n = len(list)
    for i in range(1, n):
        for j in range(n-1, i-1, -1):           #використовуємо сортування для послідовності списку

            if list[j-1] > list[j]:
                list[j],list[j-1] = list[j-1], list[j]
    return list


while True:
    try:
        n = int(input("Введіть кількість працівників: "))   #введення к-льсті працівників
        y = np.zeros(n,dtype=object)
        x = np.zeros(n, dtype=int)
        count = 0
        for i in range(n):
            y[i] = input("Введіть фамілію працівника: ")        #запис фамілії у масив
            x[i] = int(input("Введіть заробітню плату: "))      #запис зп у масив
            count += x[i]
        print(x,y)
        x1 = bubblesort(x)   
        s, b = 0, 0
        max1, max2 = 0, 0 
        newx, newy = 0, 0
        m = np.zeros(n, dtype=int)
        for i in range(n):
            m[i] = x[i] - count/n  
        for i in range(n):
            if m[i] == min(m):   
                s = x[i]
                b = y[i]
            if x1[n-1] == x[i]: #порівння для визначення найб зп
                max1 = y[i]
                max2 = y[i]
            if x1[0] == x[i]:#видаляем наймен зп
                newx = np.delete(x,i)
                newy = np.delete(y,i)
        print("Найблище до середньої заробітна плата у: ", b, " == ", s)
        print("Найбільша заробітня плата у : ",max1,max2)
        print("Масиви без мінімальної з/п: ",newx,newy)
    except ValueError:
        print("Не коректне значення")
    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
