#Чекалін Нікіта Валерійович 1 курс Завдання 6

#Створіть масив А [1..8] за допомогою генератора випадкових чисел з
#елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
#елементів масиву.

import numpy as np
import random
while True:
    a = np.array([random.randint(-10,10) for i in range(7)])#створення масиву і запис в нього значень
    count = 0
    for i in range(len(a)):
        if a[i] > 0 :#створення умови для знах - чисел
            count+=1
    print("Масив: ", a)
    print("Кількість відємних елементів: ", count)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
