#Чекалін Нікіта Вадерійович 1 курс Завдання 60

#Дан одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число
#однакових чисел, що йдуть підряд в ньому.

import numpy as np
while True:
    try:
        x = int(input("Введіть кількість чисел: "))
        a = np.empty((x), dtype=int )
        for i in range ( x ):                           #запис еслементів у масив
            a[i] = int(input("Введіть елемент : "))
        c = 0
        for j in range(x - 1):
            if a[j] == a[j + 1]:                    #задданя умови при якій буде перевірятись послідовність чисел
                c += 1
        print("Найбільша кількість елементів які йдуть попідряд : ", c)
    except ValueError:
        print("Не коректне значення" )

    print('Бажаєте продовжити роботу?')
    ex = input("Якщо ні введіть 1, якщо так будь-який символ :")
    if ex == '1':
        print("Ви вийшли з програми")
        break
    else:
        continue
        break
