#Чекалін Нікіта Валерійович 1 курс Завдання 7

#Створіть масив А [1..12] за допомогою генератора випадкових чисел з
#елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
#масиву числом 0.

import numpy as np
import random
while True:
    a = np.array([random.randint(-20,10) for i in range(12)])#створення масиву і запис в нього значень
    print("Масив:  ",a)
    for i in range(len(a)):
        if a[i]<0:#створення умови і заміна значень
            a[i] = 0

    print("Масив з заміниними елементами на 0 ",a)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
