#Чекалін Нікіта Валерійович 1 курс Завдання 8

#Створіть цілочисельний масив А [1..15] за допомогою генератора
#випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
#найбільший елемент масиву і його індекс.


import numpy as np
import random
while True:
    a = np.array([random.randint(-15,30) for i in range(15)])#створення масиву і запис в нього значень за доп генератора
    index = 0
    for i in range(len(a)):
        if a[i] == max(a):#створення умови на найб число
            index = i
    print("Масив: ", a)
    print("Максимальний елемент: ", max(a))
    print("Індекс максимального елементу: ", index)
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
