#Чекалін Нікіта Валерійович 1 курс Завдання 9


#З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
#що протягом цього часу температура знижувалася. Визначте, о котрій годині було
#вперше зафіксовано від'ємну температуру.


import numpy as np
while True:
    b = int(input("Ведіть на скільки знижалась температура: "))#введення значень
    c = int(input("Введіть початкову температуру: "))#введення значень
    a = np.array([c for i in range(8)])#створення послідовності
    print(a)
    d = ""
    for i in range(len(a)):
        a[i] = a[i-1] - b#задання умови для визнач точної години
    for i in range(len(a)):
        if a[i] < 0:
            d = i
            break
    print("Данні про температуру ",a)
    print("Зафіксовано вперше від'ємну температуру в ",d," годині")
    print("Щоб запустити програму спочатку натисніть  1. Для виходу будь яке інше значення")
    choise = input()
    if choise == "1":
        continue
    else:
        break
